Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_gpio.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     nrf5340_application_gpio equates.
 */

#pragma once

#include    <stdint.h>

// GPIO address definitions
// ------------------------

typedef struct {
    volatile    uint32_t    RESERVED0;
    volatile    uint32_t    OUT;
    volatile    uint32_t    OUTSET;
    volatile    uint32_t    OUTCLR;
    volatile    uint32_t    IN;
    volatile    uint32_t    DIR;
    volatile    uint32_t    DIRSET;
    volatile    uint32_t    DIRCLR;
    volatile    uint32_t    LATCH;
    volatile    uint32_t    DETECTMODE;
    volatile    uint32_t    DETECTMODE_SEC;
    volatile    uint32_t    RESERVED1[117];
    volatile    uint32_t    PIN_CNF[32];
} GPIO_TypeDef;

#ifdef __cplusplus
#define P0_NS   reinterpret_cast<GPIO_TypeDef *>(0x40842500U)
#define P1_NS   reinterpret_cast<GPIO_TypeDef *>(0x40842800U)
#define P0_S    reinterpret_cast<GPIO_TypeDef *>(0x50842500U)
#define P1_S    reinterpret_cast<GPIO_TypeDef *>(0x50842800U)

#else
#define P0_NS   ((GPIO_TypeDef *)0x40842500U)
#define P1_NS   ((GPIO_TypeDef *)0x40842800U)
#define P0_S    ((GPIO_TypeDef *)0x50842500U)
#define P1_S    ((GPIO_TypeDef *)0x50842800U)
#endif

// OUT Configuration

#define GPIO_OUT_PIN31                          (0x1U<<31U)
#define GPIO_OUT_PIN30                          (0x1U<<30U)
#define GPIO_OUT_PIN29                          (0x1U<<29U)
#define GPIO_OUT_PIN28                          (0x1U<<28U)
#define GPIO_OUT_PIN27                          (0x1U<<27U)
#define GPIO_OUT_PIN26                          (0x1U<<26U)
#define GPIO_OUT_PIN25                          (0x1U<<25U)
#define GPIO_OUT_PIN24                          (0x1U<<24U)
#define GPIO_OUT_PIN23                          (0x1U<<23U)
#define GPIO_OUT_PIN22                          (0x1U<<22U)
#define GPIO_OUT_PIN21                          (0x1U<<21U)
#define GPIO_OUT_PIN20                          (0x1U<<20U)
#define GPIO_OUT_PIN19                          (0x1U<<19U)
#define GPIO_OUT_PIN18                          (0x1U<<18U)
#define GPIO_OUT_PIN17                          (0x1U<<17U)
#define GPIO_OUT_PIN16                          (0x1U<<16U)
#define GPIO_OUT_PIN15                          (0x1U<<15U)
#define GPIO_OUT_PIN14                          (0x1U<<14U)
#define GPIO_OUT_PIN13                          (0x1U<<13U)
#define GPIO_OUT_PIN12                          (0x1U<<12U)
#define GPIO_OUT_PIN11                          (0x1U<<11U)
#define GPIO_OUT_PIN10                          (0x1U<<10U)
#define GPIO_OUT_PIN9                           (0x1U<<9U)
#define GPIO_OUT_PIN8                           (0x1U<<8U)
#define GPIO_OUT_PIN7                           (0x1U<<7U)
#define GPIO_OUT_PIN6                           (0x1U<<6U)
#define GPIO_OUT_PIN5                           (0x1U<<5U)
#define GPIO_OUT_PIN4                           (0x1U<<4U)
#define GPIO_OUT_PIN3                           (0x1U<<3U)
#define GPIO_OUT_PIN2                           (0x1U<<2U)
#define GPIO_OUT_PIN1                           (0x1U<<1U)
#define GPIO_OUT_PIN0                           (0x1U<<0U)
#define GPIO_OUT_PIN31_LOW                      (0x0U<<31U)
#define GPIO_OUT_PIN31_HIGH                     (0x1U<<31U)
#define GPIO_OUT_PIN30_LOW                      (0x0U<<30U)
#define GPIO_OUT_PIN30_HIGH                     (0x1U<<30U)
#define GPIO_OUT_PIN29_LOW                      (0x0U<<29U)
#define GPIO_OUT_PIN29_HIGH                     (0x1U<<29U)
#define GPIO_OUT_PIN28_LOW                      (0x0U<<28U)
#define GPIO_OUT_PIN28_HIGH                     (0x1U<<28U)
#define GPIO_OUT_PIN27_LOW                      (0x0U<<27U)
#define GPIO_OUT_PIN27_HIGH                     (0x1U<<27U)
#define GPIO_OUT_PIN26_LOW                      (0x0U<<26U)
#define GPIO_OUT_PIN26_HIGH                     (0x1U<<26U)
#define GPIO_OUT_PIN25_LOW                      (0x0U<<25U)
#define GPIO_OUT_PIN25_HIGH                     (0x1U<<25U)
#define GPIO_OUT_PIN24_LOW                      (0x0U<<24U)
#define GPIO_OUT_PIN24_HIGH                     (0x1U<<24U)
#define GPIO_OUT_PIN23_LOW                      (0x0U<<23U)
#define GPIO_OUT_PIN23_HIGH                     (0x1U<<23U)
#define GPIO_OUT_PIN22_LOW                      (0x0U<<22U)
#define GPIO_OUT_PIN22_HIGH                     (0x1U<<22U)
#define GPIO_OUT_PIN21_LOW                      (0x0U<<21U)
#define GPIO_OUT_PIN21_HIGH                     (0x1U<<21U)
#define GPIO_OUT_PIN20_LOW                      (0x0U<<20U)
#define GPIO_OUT_PIN20_HIGH                     (0x1U<<20U)
#define GPIO_OUT_PIN19_LOW                      (0x0U<<19U)
#define GPIO_OUT_PIN19_HIGH                     (0x1U<<19U)
#define GPIO_OUT_PIN18_LOW                      (0x0U<<18U)
#define GPIO_OUT_PIN18_HIGH                     (0x1U<<18U)
#define GPIO_OUT_PIN17_LOW                      (0x0U<<17U)
#define GPIO_OUT_PIN17_HIGH                     (0x1U<<17U)
#define GPIO_OUT_PIN16_LOW                      (0x0U<<16U)
#define GPIO_OUT_PIN16_HIGH                     (0x1U<<16U)
#define GPIO_OUT_PIN15_LOW                      (0x0U<<15U)
#define GPIO_OUT_PIN15_HIGH                     (0x1U<<15U)
#define GPIO_OUT_PIN14_LOW                      (0x0U<<14U)
#define GPIO_OUT_PIN14_HIGH                     (0x1U<<14U)
#define GPIO_OUT_PIN13_LOW                      (0x0U<<13U)
#define GPIO_OUT_PIN13_HIGH                     (0x1U<<13U)
#define GPIO_OUT_PIN12_LOW                      (0x0U<<12U)
#define GPIO_OUT_PIN12_HIGH                     (0x1U<<12U)
#define GPIO_OUT_PIN11_LOW                      (0x0U<<11U)
#define GPIO_OUT_PIN11_HIGH                     (0x1U<<11U)
#define GPIO_OUT_PIN10_LOW                      (0x0U<<10U)
#define GPIO_OUT_PIN10_HIGH                     (0x1U<<10U)
#define GPIO_OUT_PIN9_LOW                       (0x0U<<9U)
#define GPIO_OUT_PIN9_HIGH                      (0x1U<<9U)
#define GPIO_OUT_PIN8_LOW                       (0x0U<<8U)
#define GPIO_OUT_PIN8_HIGH                      (0x1U<<8U)
#define GPIO_OUT_PIN7_LOW                       (0x0U<<7U)
#define GPIO_OUT_PIN7_HIGH                      (0x1U<<7U)
#define GPIO_OUT_PIN6_LOW                       (0x0U<<6U)
#define GPIO_OUT_PIN6_HIGH                      (0x1U<<6U)
#define GPIO_OUT_PIN5_LOW                       (0x0U<<5U)
#define GPIO_OUT_PIN5_HIGH                      (0x1U<<5U)
#define GPIO_OUT_PIN4_LOW                       (0x0U<<4U)
#define GPIO_OUT_PIN4_HIGH                      (0x1U<<4U)
#define GPIO_OUT_PIN3_LOW                       (0x0U<<3U)
#define GPIO_OUT_PIN3_HIGH                      (0x1U<<3U)
#define GPIO_OUT_PIN2_LOW                       (0x0U<<2U)
#define GPIO_OUT_PIN2_HIGH                      (0x1U<<2U)
#define GPIO_OUT_PIN1_LOW                       (0x0U<<1U)
#define GPIO_OUT_PIN1_HIGH                      (0x1U<<1U)
#define GPIO_OUT_PIN0_LOW                       (0x0U<<0U)
#define GPIO_OUT_PIN0_HIGH                      (0x1U<<0U)

// OUTSET Configuration

#define GPIO_OUTSET_PIN31                       (0x1U<<31U)
#define GPIO_OUTSET_PIN30                       (0x1U<<30U)
#define GPIO_OUTSET_PIN29                       (0x1U<<29U)
#define GPIO_OUTSET_PIN28                       (0x1U<<28U)
#define GPIO_OUTSET_PIN27                       (0x1U<<27U)
#define GPIO_OUTSET_PIN26                       (0x1U<<26U)
#define GPIO_OUTSET_PIN25                       (0x1U<<25U)
#define GPIO_OUTSET_PIN24                       (0x1U<<24U)
#define GPIO_OUTSET_PIN23                       (0x1U<<23U)
#define GPIO_OUTSET_PIN22                       (0x1U<<22U)
#define GPIO_OUTSET_PIN21                       (0x1U<<21U)
#define GPIO_OUTSET_PIN20                       (0x1U<<20U)
#define GPIO_OUTSET_PIN19                       (0x1U<<19U)
#define GPIO_OUTSET_PIN18                       (0x1U<<18U)
#define GPIO_OUTSET_PIN17                       (0x1U<<17U)
#define GPIO_OUTSET_PIN16                       (0x1U<<16U)
#define GPIO_OUTSET_PIN15                       (0x1U<<15U)
#define GPIO_OUTSET_PIN14                       (0x1U<<14U)
#define GPIO_OUTSET_PIN13                       (0x1U<<13U)
#define GPIO_OUTSET_PIN12                       (0x1U<<12U)
#define GPIO_OUTSET_PIN11                       (0x1U<<11U)
#define GPIO_OUTSET_PIN10                       (0x1U<<10U)
#define GPIO_OUTSET_PIN9                        (0x1U<<9U)
#define GPIO_OUTSET_PIN8                        (0x1U<<8U)
#define GPIO_OUTSET_PIN7                        (0x1U<<7U)
#define GPIO_OUTSET_PIN6                        (0x1U<<6U)
#define GPIO_OUTSET_PIN5                        (0x1U<<5U)
#define GPIO_OUTSET_PIN4                        (0x1U<<4U)
#define GPIO_OUTSET_PIN3                        (0x1U<<3U)
#define GPIO_OUTSET_PIN2                        (0x1U<<2U)
#define GPIO_OUTSET_PIN1                        (0x1U<<1U)
#define GPIO_OUTSET_PIN0                        (0x1U<<0U)
#define GPIO_OUTSET_PIN31_LOW                   (0x0U<<31U)
#define GPIO_OUTSET_PIN31_HIGH                  (0x1U<<31U)
#define GPIO_OUTSET_PIN31_SET                   (0x1U<<31U)
#define GPIO_OUTSET_PIN30_LOW                   (0x0U<<30U)
#define GPIO_OUTSET_PIN30_HIGH                  (0x1U<<30U)
#define GPIO_OUTSET_PIN30_SET                   (0x1U<<30U)
#define GPIO_OUTSET_PIN29_LOW                   (0x0U<<29U)
#define GPIO_OUTSET_PIN29_HIGH                  (0x1U<<29U)
#define GPIO_OUTSET_PIN29_SET                   (0x1U<<29U)
#define GPIO_OUTSET_PIN28_LOW                   (0x0U<<28U)
#define GPIO_OUTSET_PIN28_HIGH                  (0x1U<<28U)
#define GPIO_OUTSET_PIN28_SET                   (0x1U<<28U)
#define GPIO_OUTSET_PIN27_LOW                   (0x0U<<27U)
#define GPIO_OUTSET_PIN27_HIGH                  (0x1U<<27U)
#define GPIO_OUTSET_PIN27_SET                   (0x1U<<27U)
#define GPIO_OUTSET_PIN26_LOW                   (0x0U<<26U)
#define GPIO_OUTSET_PIN26_HIGH                  (0x1U<<26U)
#define GPIO_OUTSET_PIN26_SET                   (0x1U<<26U)
#define GPIO_OUTSET_PIN25_LOW                   (0x0U<<25U)
#define GPIO_OUTSET_PIN25_HIGH                  (0x1U<<25U)
#define GPIO_OUTSET_PIN25_SET                   (0x1U<<25U)
#define GPIO_OUTSET_PIN24_LOW                   (0x0U<<24U)
#define GPIO_OUTSET_PIN24_HIGH                  (0x1U<<24U)
#define GPIO_OUTSET_PIN24_SET                   (0x1U<<24U)
#define GPIO_OUTSET_PIN23_LOW                   (0x0U<<23U)
#define GPIO_OUTSET_PIN23_HIGH                  (0x1U<<23U)
#define GPIO_OUTSET_PIN23_SET                   (0x1U<<23U)
#define GPIO_OUTSET_PIN22_LOW                   (0x0U<<22U)
#define GPIO_OUTSET_PIN22_HIGH                  (0x1U<<22U)
#define GPIO_OUTSET_PIN22_SET                   (0x1U<<22U)
#define GPIO_OUTSET_PIN21_LOW                   (0x0U<<21U)
#define GPIO_OUTSET_PIN21_HIGH                  (0x1U<<21U)
#define GPIO_OUTSET_PIN21_SET                   (0x1U<<21U)
#define GPIO_OUTSET_PIN20_LOW                   (0x0U<<20U)
#define GPIO_OUTSET_PIN20_HIGH                  (0x1U<<20U)
#define GPIO_OUTSET_PIN20_SET                   (0x1U<<20U)
#define GPIO_OUTSET_PIN19_LOW                   (0x0U<<19U)
#define GPIO_OUTSET_PIN19_HIGH                  (0x1U<<19U)
#define GPIO_OUTSET_PIN19_SET                   (0x1U<<19U)
#define GPIO_OUTSET_PIN18_LOW                   (0x0U<<18U)
#define GPIO_OUTSET_PIN18_HIGH                  (0x1U<<18U)
#define GPIO_OUTSET_PIN18_SET                   (0x1U<<18U)
#define GPIO_OUTSET_PIN17_LOW                   (0x0U<<17U)
#define GPIO_OUTSET_PIN17_HIGH                  (0x1U<<17U)
#define GPIO_OUTSET_PIN17_SET                   (0x1U<<17U)
#define GPIO_OUTSET_PIN16_LOW                   (0x0U<<16U)
#define GPIO_OUTSET_PIN16_HIGH                  (0x1U<<16U)
#define GPIO_OUTSET_PIN16_SET                   (0x1U<<16U)
#define GPIO_OUTSET_PIN15_LOW                   (0x0U<<15U)
#define GPIO_OUTSET_PIN15_HIGH                  (0x1U<<15U)
#define GPIO_OUTSET_PIN15_SET                   (0x1U<<15U)
#define GPIO_OUTSET_PIN14_LOW                   (0x0U<<14U)
#define GPIO_OUTSET_PIN14_HIGH                  (0x1U<<14U)
#define GPIO_OUTSET_PIN14_SET                   (0x1U<<14U)
#define GPIO_OUTSET_PIN13_LOW                   (0x0U<<13U)
#define GPIO_OUTSET_PIN13_HIGH                  (0x1U<<13U)
#define GPIO_OUTSET_PIN13_SET                   (0x1U<<13U)
#define GPIO_OUTSET_PIN12_LOW                   (0x0U<<12U)
#define GPIO_OUTSET_PIN12_HIGH                  (0x1U<<12U)
#define GPIO_OUTSET_PIN12_SET                   (0x1U<<12U)
#define GPIO_OUTSET_PIN11_LOW                   (0x0U<<11U)
#define GPIO_OUTSET_PIN11_HIGH                  (0x1U<<11U)
#define GPIO_OUTSET_PIN11_SET                   (0x1U<<11U)
#define GPIO_OUTSET_PIN10_LOW                   (0x0U<<10U)
#define GPIO_OUTSET_PIN10_HIGH                  (0x1U<<10U)
#define GPIO_OUTSET_PIN10_SET                   (0x1U<<10U)
#define GPIO_OUTSET_PIN9_LOW                    (0x0U<<9U)
#define GPIO_OUTSET_PIN9_HIGH                   (0x1U<<9U)
#define GPIO_OUTSET_PIN9_SET                    (0x1U<<9U)
#define GPIO_OUTSET_PIN8_LOW                    (0x0U<<8U)
#define GPIO_OUTSET_PIN8_HIGH                   (0x1U<<8U)
#define GPIO_OUTSET_PIN8_SET                    (0x1U<<8U)
#define GPIO_OUTSET_PIN7_LOW                    (0x0U<<7U)
#define GPIO_OUTSET_PIN7_HIGH                   (0x1U<<7U)
#define GPIO_OUTSET_PIN7_SET                    (0x1U<<7U)
#define GPIO_OUTSET_PIN6_LOW                    (0x0U<<6U)
#define GPIO_OUTSET_PIN6_HIGH                   (0x1U<<6U)
#define GPIO_OUTSET_PIN6_SET                    (0x1U<<6U)
#define GPIO_OUTSET_PIN5_LOW                    (0x0U<<5U)
#define GPIO_OUTSET_PIN5_HIGH                   (0x1U<<5U)
#define GPIO_OUTSET_PIN5_SET                    (0x1U<<5U)
#define GPIO_OUTSET_PIN4_LOW                    (0x0U<<4U)
#define GPIO_OUTSET_PIN4_HIGH                   (0x1U<<4U)
#define GPIO_OUTSET_PIN4_SET                    (0x1U<<4U)
#define GPIO_OUTSET_PIN3_LOW                    (0x0U<<3U)
#define GPIO_OUTSET_PIN3_HIGH                   (0x1U<<3U)
#define GPIO_OUTSET_PIN3_SET                    (0x1U<<3U)
#define GPIO_OUTSET_PIN2_LOW                    (0x0U<<2U)
#define GPIO_OUTSET_PIN2_HIGH                   (0x1U<<2U)
#define GPIO_OUTSET_PIN2_SET                    (0x1U<<2U)
#define GPIO_OUTSET_PIN1_LOW                    (0x0U<<1U)
#define GPIO_OUTSET_PIN1_HIGH                   (0x1U<<1U)
#define GPIO_OUTSET_PIN1_SET                    (0x1U<<1U)
#define GPIO_OUTSET_PIN0_LOW                    (0x0U<<0U)
#define GPIO_OUTSET_PIN0_HIGH                   (0x1U<<0U)
#define GPIO_OUTSET_PIN0_SET                    (0x1U<<0U)

// OUTCLR Configuration

#define GPIO_OUTCLR_PIN31                       (0x1U<<31U)
#define GPIO_OUTCLR_PIN30                       (0x1U<<30U)
#define GPIO_OUTCLR_PIN29                       (0x1U<<29U)
#define GPIO_OUTCLR_PIN28                       (0x1U<<28U)
#define GPIO_OUTCLR_PIN27                       (0x1U<<27U)
#define GPIO_OUTCLR_PIN26                       (0x1U<<26U)
#define GPIO_OUTCLR_PIN25                       (0x1U<<25U)
#define GPIO_OUTCLR_PIN24                       (0x1U<<24U)
#define GPIO_OUTCLR_PIN23                       (0x1U<<23U)
#define GPIO_OUTCLR_PIN22                       (0x1U<<22U)
#define GPIO_OUTCLR_PIN21                       (0x1U<<21U)
#define GPIO_OUTCLR_PIN20                       (0x1U<<20U)
#define GPIO_OUTCLR_PIN19                       (0x1U<<19U)
#define GPIO_OUTCLR_PIN18                       (0x1U<<18U)
#define GPIO_OUTCLR_PIN17                       (0x1U<<17U)
#define GPIO_OUTCLR_PIN16                       (0x1U<<16U)
#define GPIO_OUTCLR_PIN15                       (0x1U<<15U)
#define GPIO_OUTCLR_PIN14                       (0x1U<<14U)
#define GPIO_OUTCLR_PIN13                       (0x1U<<13U)
#define GPIO_OUTCLR_PIN12                       (0x1U<<12U)
#define GPIO_OUTCLR_PIN11                       (0x1U<<11U)
#define GPIO_OUTCLR_PIN10                       (0x1U<<10U)
#define GPIO_OUTCLR_PIN9                        (0x1U<<9U)
#define GPIO_OUTCLR_PIN8                        (0x1U<<8U)
#define GPIO_OUTCLR_PIN7                        (0x1U<<7U)
#define GPIO_OUTCLR_PIN6                        (0x1U<<6U)
#define GPIO_OUTCLR_PIN5                        (0x1U<<5U)
#define GPIO_OUTCLR_PIN4                        (0x1U<<4U)
#define GPIO_OUTCLR_PIN3                        (0x1U<<3U)
#define GPIO_OUTCLR_PIN2                        (0x1U<<2U)
#define GPIO_OUTCLR_PIN1                        (0x1U<<1U)
#define GPIO_OUTCLR_PIN0                        (0x1U<<0U)
#define GPIO_OUTCLR_PIN31_LOW                   (0x0U<<31U)
#define GPIO_OUTCLR_PIN31_HIGH                  (0x1U<<31U)
#define GPIO_OUTCLR_PIN31_CLEAR                 (0x1U<<31U)
#define GPIO_OUTCLR_PIN30_LOW                   (0x0U<<30U)
#define GPIO_OUTCLR_PIN30_HIGH                  (0x1U<<30U)
#define GPIO_OUTCLR_PIN30_CLEAR                 (0x1U<<30U)
#define GPIO_OUTCLR_PIN29_LOW                   (0x0U<<29U)
#define GPIO_OUTCLR_PIN29_HIGH                  (0x1U<<29U)
#define GPIO_OUTCLR_PIN29_CLEAR                 (0x1U<<29U)
#define GPIO_OUTCLR_PIN28_LOW                   (0x0U<<28U)
#define GPIO_OUTCLR_PIN28_HIGH                  (0x1U<<28U)
#define GPIO_OUTCLR_PIN28_CLEAR                 (0x1U<<28U)
#define GPIO_OUTCLR_PIN27_LOW                   (0x0U<<27U)
#define GPIO_OUTCLR_PIN27_HIGH                  (0x1U<<27U)
#define GPIO_OUTCLR_PIN27_CLEAR                 (0x1U<<27U)
#define GPIO_OUTCLR_PIN26_LOW                   (0x0U<<26U)
#define GPIO_OUTCLR_PIN26_HIGH                  (0x1U<<26U)
#define GPIO_OUTCLR_PIN26_CLEAR                 (0x1U<<26U)
#define GPIO_OUTCLR_PIN25_LOW                   (0x0U<<25U)
#define GPIO_OUTCLR_PIN25_HIGH                  (0x1U<<25U)
#define GPIO_OUTCLR_PIN25_CLEAR                 (0x1U<<25U)
#define GPIO_OUTCLR_PIN24_LOW                   (0x0U<<24U)
#define GPIO_OUTCLR_PIN24_HIGH                  (0x1U<<24U)
#define GPIO_OUTCLR_PIN24_CLEAR                 (0x1U<<24U)
#define GPIO_OUTCLR_PIN23_LOW                   (0x0U<<23U)
#define GPIO_OUTCLR_PIN23_HIGH                  (0x1U<<23U)
#define GPIO_OUTCLR_PIN23_CLEAR                 (0x1U<<23U)
#define GPIO_OUTCLR_PIN22_LOW                   (0x0U<<22U)
#define GPIO_OUTCLR_PIN22_HIGH                  (0x1U<<22U)
#define GPIO_OUTCLR_PIN22_CLEAR                 (0x1U<<22U)
#define GPIO_OUTCLR_PIN21_LOW                   (0x0U<<21U)
#define GPIO_OUTCLR_PIN21_HIGH                  (0x1U<<21U)
#define GPIO_OUTCLR_PIN21_CLEAR                 (0x1U<<21U)
#define GPIO_OUTCLR_PIN20_LOW                   (0x0U<<20U)
#define GPIO_OUTCLR_PIN20_HIGH                  (0x1U<<20U)
#define GPIO_OUTCLR_PIN20_CLEAR                 (0x1U<<20U)
#define GPIO_OUTCLR_PIN19_LOW                   (0x0U<<19U)
#define GPIO_OUTCLR_PIN19_HIGH                  (0x1U<<19U)
#define GPIO_OUTCLR_PIN19_CLEAR                 (0x1U<<19U)
#define GPIO_OUTCLR_PIN18_LOW                   (0x0U<<18U)
#define GPIO_OUTCLR_PIN18_HIGH                  (0x1U<<18U)
#define GPIO_OUTCLR_PIN18_CLEAR                 (0x1U<<18U)
#define GPIO_OUTCLR_PIN17_LOW                   (0x0U<<17U)
#define GPIO_OUTCLR_PIN17_HIGH                  (0x1U<<17U)
#define GPIO_OUTCLR_PIN17_CLEAR                 (0x1U<<17U)
#define GPIO_OUTCLR_PIN16_LOW                   (0x0U<<16U)
#define GPIO_OUTCLR_PIN16_HIGH                  (0x1U<<16U)
#define GPIO_OUTCLR_PIN16_CLEAR                 (0x1U<<16U)
#define GPIO_OUTCLR_PIN15_LOW                   (0x0U<<15U)
#define GPIO_OUTCLR_PIN15_HIGH                  (0x1U<<15U)
#define GPIO_OUTCLR_PIN15_CLEAR                 (0x1U<<15U)
#define GPIO_OUTCLR_PIN14_LOW                   (0x0U<<14U)
#define GPIO_OUTCLR_PIN14_HIGH                  (0x1U<<14U)
#define GPIO_OUTCLR_PIN14_CLEAR                 (0x1U<<14U)
#define GPIO_OUTCLR_PIN13_LOW                   (0x0U<<13U)
#define GPIO_OUTCLR_PIN13_HIGH                  (0x1U<<13U)
#define GPIO_OUTCLR_PIN13_CLEAR                 (0x1U<<13U)
#define GPIO_OUTCLR_PIN12_LOW                   (0x0U<<12U)
#define GPIO_OUTCLR_PIN12_HIGH                  (0x1U<<12U)
#define GPIO_OUTCLR_PIN12_CLEAR                 (0x1U<<12U)
#define GPIO_OUTCLR_PIN11_LOW                   (0x0U<<11U)
#define GPIO_OUTCLR_PIN11_HIGH                  (0x1U<<11U)
#define GPIO_OUTCLR_PIN11_CLEAR                 (0x1U<<11U)
#define GPIO_OUTCLR_PIN10_LOW                   (0x0U<<10U)
#define GPIO_OUTCLR_PIN10_HIGH                  (0x1U<<10U)
#define GPIO_OUTCLR_PIN10_CLEAR                 (0x1U<<10U)
#define GPIO_OUTCLR_PIN9_LOW                    (0x0U<<9U)
#define GPIO_OUTCLR_PIN9_HIGH                   (0x1U<<9U)
#define GPIO_OUTCLR_PIN9_CLEAR                  (0x1U<<9U)
#define GPIO_OUTCLR_PIN8_LOW                    (0x0U<<8U)
#define GPIO_OUTCLR_PIN8_HIGH                   (0x1U<<8U)
#define GPIO_OUTCLR_PIN8_CLEAR                  (0x1U<<8U)
#define GPIO_OUTCLR_PIN7_LOW                    (0x0U<<7U)
#define GPIO_OUTCLR_PIN7_HIGH                   (0x1U<<7U)
#define GPIO_OUTCLR_PIN7_CLEAR                  (0x1U<<7U)
#define GPIO_OUTCLR_PIN6_LOW                    (0x0U<<6U)
#define GPIO_OUTCLR_PIN6_HIGH                   (0x1U<<6U)
#define GPIO_OUTCLR_PIN6_CLEAR                  (0x1U<<6U)
#define GPIO_OUTCLR_PIN5_LOW                    (0x0U<<5U)
#define GPIO_OUTCLR_PIN5_HIGH                   (0x1U<<5U)
#define GPIO_OUTCLR_PIN5_CLEAR                  (0x1U<<5U)
#define GPIO_OUTCLR_PIN4_LOW                    (0x0U<<4U)
#define GPIO_OUTCLR_PIN4_HIGH                   (0x1U<<4U)
#define GPIO_OUTCLR_PIN4_CLEAR                  (0x1U<<4U)
#define GPIO_OUTCLR_PIN3_LOW                    (0x0U<<3U)
#define GPIO_OUTCLR_PIN3_HIGH                   (0x1U<<3U)
#define GPIO_OUTCLR_PIN3_CLEAR                  (0x1U<<3U)
#define GPIO_OUTCLR_PIN2_LOW                    (0x0U<<2U)
#define GPIO_OUTCLR_PIN2_HIGH                   (0x1U<<2U)
#define GPIO_OUTCLR_PIN2_CLEAR                  (0x1U<<2U)
#define GPIO_OUTCLR_PIN1_LOW                    (0x0U<<1U)
#define GPIO_OUTCLR_PIN1_HIGH                   (0x1U<<1U)
#define GPIO_OUTCLR_PIN1_CLEAR                  (0x1U<<1U)
#define GPIO_OUTCLR_PIN0_LOW                    (0x0U<<0U)
#define GPIO_OUTCLR_PIN0_HIGH                   (0x1U<<0U)
#define GPIO_OUTCLR_PIN0_CLEAR                  (0x1U<<0U)

// IN Configuration

