Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_gpio.h
#define GPIO_IN_PIN31                           (0x1U<<31U)
#define GPIO_IN_PIN30                           (0x1U<<30U)
#define GPIO_IN_PIN29                           (0x1U<<29U)
#define GPIO_IN_PIN28                           (0x1U<<28U)
#define GPIO_IN_PIN27                           (0x1U<<27U)
#define GPIO_IN_PIN26                           (0x1U<<26U)
#define GPIO_IN_PIN25                           (0x1U<<25U)
#define GPIO_IN_PIN24                           (0x1U<<24U)
#define GPIO_IN_PIN23                           (0x1U<<23U)
#define GPIO_IN_PIN22                           (0x1U<<22U)
#define GPIO_IN_PIN21                           (0x1U<<21U)
#define GPIO_IN_PIN20                           (0x1U<<20U)
#define GPIO_IN_PIN19                           (0x1U<<19U)
#define GPIO_IN_PIN18                           (0x1U<<18U)
#define GPIO_IN_PIN17                           (0x1U<<17U)
#define GPIO_IN_PIN16                           (0x1U<<16U)
#define GPIO_IN_PIN15                           (0x1U<<15U)
#define GPIO_IN_PIN14                           (0x1U<<14U)
#define GPIO_IN_PIN13                           (0x1U<<13U)
#define GPIO_IN_PIN12                           (0x1U<<12U)
#define GPIO_IN_PIN11                           (0x1U<<11U)
#define GPIO_IN_PIN10                           (0x1U<<10U)
#define GPIO_IN_PIN9                            (0x1U<<9U)
#define GPIO_IN_PIN8                            (0x1U<<8U)
#define GPIO_IN_PIN7                            (0x1U<<7U)
#define GPIO_IN_PIN6                            (0x1U<<6U)
#define GPIO_IN_PIN5                            (0x1U<<5U)
#define GPIO_IN_PIN4                            (0x1U<<4U)
#define GPIO_IN_PIN3                            (0x1U<<3U)
#define GPIO_IN_PIN2                            (0x1U<<2U)
#define GPIO_IN_PIN1                            (0x1U<<1U)
#define GPIO_IN_PIN0                            (0x1U<<0U)
#define GPIO_IN_PIN31_LOW                       (0x0U<<31U)
#define GPIO_IN_PIN31_HIGH                      (0x1U<<31U)
#define GPIO_IN_PIN30_LOW                       (0x0U<<30U)
#define GPIO_IN_PIN30_HIGH                      (0x1U<<30U)
#define GPIO_IN_PIN29_LOW                       (0x0U<<29U)
#define GPIO_IN_PIN29_HIGH                      (0x1U<<29U)
#define GPIO_IN_PIN28_LOW                       (0x0U<<28U)
#define GPIO_IN_PIN28_HIGH                      (0x1U<<28U)
#define GPIO_IN_PIN27_LOW                       (0x0U<<27U)
#define GPIO_IN_PIN27_HIGH                      (0x1U<<27U)
#define GPIO_IN_PIN26_LOW                       (0x0U<<26U)
#define GPIO_IN_PIN26_HIGH                      (0x1U<<26U)
#define GPIO_IN_PIN25_LOW                       (0x0U<<25U)
#define GPIO_IN_PIN25_HIGH                      (0x1U<<25U)
#define GPIO_IN_PIN24_LOW                       (0x0U<<24U)
#define GPIO_IN_PIN24_HIGH                      (0x1U<<24U)
#define GPIO_IN_PIN23_LOW                       (0x0U<<23U)
#define GPIO_IN_PIN23_HIGH                      (0x1U<<23U)
#define GPIO_IN_PIN22_LOW                       (0x0U<<22U)
#define GPIO_IN_PIN22_HIGH                      (0x1U<<22U)
#define GPIO_IN_PIN21_LOW                       (0x0U<<21U)
#define GPIO_IN_PIN21_HIGH                      (0x1U<<21U)
#define GPIO_IN_PIN20_LOW                       (0x0U<<20U)
#define GPIO_IN_PIN20_HIGH                      (0x1U<<20U)
#define GPIO_IN_PIN19_LOW                       (0x0U<<19U)
#define GPIO_IN_PIN19_HIGH                      (0x1U<<19U)
#define GPIO_IN_PIN18_LOW                       (0x0U<<18U)
#define GPIO_IN_PIN18_HIGH                      (0x1U<<18U)
#define GPIO_IN_PIN17_LOW                       (0x0U<<17U)
#define GPIO_IN_PIN17_HIGH                      (0x1U<<17U)
#define GPIO_IN_PIN16_LOW                       (0x0U<<16U)
#define GPIO_IN_PIN16_HIGH                      (0x1U<<16U)
#define GPIO_IN_PIN15_LOW                       (0x0U<<15U)
#define GPIO_IN_PIN15_HIGH                      (0x1U<<15U)
#define GPIO_IN_PIN14_LOW                       (0x0U<<14U)
#define GPIO_IN_PIN14_HIGH                      (0x1U<<14U)
#define GPIO_IN_PIN13_LOW                       (0x0U<<13U)
#define GPIO_IN_PIN13_HIGH                      (0x1U<<13U)
#define GPIO_IN_PIN12_LOW                       (0x0U<<12U)
#define GPIO_IN_PIN12_HIGH                      (0x1U<<12U)
#define GPIO_IN_PIN11_LOW                       (0x0U<<11U)
#define GPIO_IN_PIN11_HIGH                      (0x1U<<11U)
#define GPIO_IN_PIN10_LOW                       (0x0U<<10U)
#define GPIO_IN_PIN10_HIGH                      (0x1U<<10U)
#define GPIO_IN_PIN9_LOW                        (0x0U<<9U)
#define GPIO_IN_PIN9_HIGH                       (0x1U<<9U)
#define GPIO_IN_PIN8_LOW                        (0x0U<<8U)
#define GPIO_IN_PIN8_HIGH                       (0x1U<<8U)
#define GPIO_IN_PIN7_LOW                        (0x0U<<7U)
#define GPIO_IN_PIN7_HIGH                       (0x1U<<7U)
#define GPIO_IN_PIN6_LOW                        (0x0U<<6U)
#define GPIO_IN_PIN6_HIGH                       (0x1U<<6U)
#define GPIO_IN_PIN5_LOW                        (0x0U<<5U)
#define GPIO_IN_PIN5_HIGH                       (0x1U<<5U)
#define GPIO_IN_PIN4_LOW                        (0x0U<<4U)
#define GPIO_IN_PIN4_HIGH                       (0x1U<<4U)
#define GPIO_IN_PIN3_LOW                        (0x0U<<3U)
#define GPIO_IN_PIN3_HIGH                       (0x1U<<3U)
#define GPIO_IN_PIN2_LOW                        (0x0U<<2U)
#define GPIO_IN_PIN2_HIGH                       (0x1U<<2U)
#define GPIO_IN_PIN1_LOW                        (0x0U<<1U)
#define GPIO_IN_PIN1_HIGH                       (0x1U<<1U)
#define GPIO_IN_PIN0_LOW                        (0x0U<<0U)
#define GPIO_IN_PIN0_HIGH                       (0x1U<<0U)

// DIR Configuration

#define GPIO_DIR_PIN31                          (0x1U<<31U)
#define GPIO_DIR_PIN30                          (0x1U<<30U)
#define GPIO_DIR_PIN29                          (0x1U<<29U)
#define GPIO_DIR_PIN28                          (0x1U<<28U)
#define GPIO_DIR_PIN27                          (0x1U<<27U)
#define GPIO_DIR_PIN26                          (0x1U<<26U)
#define GPIO_DIR_PIN25                          (0x1U<<25U)
#define GPIO_DIR_PIN24                          (0x1U<<24U)
#define GPIO_DIR_PIN23                          (0x1U<<23U)
#define GPIO_DIR_PIN22                          (0x1U<<22U)
#define GPIO_DIR_PIN21                          (0x1U<<21U)
#define GPIO_DIR_PIN20                          (0x1U<<20U)
#define GPIO_DIR_PIN19                          (0x1U<<19U)
#define GPIO_DIR_PIN18                          (0x1U<<18U)
#define GPIO_DIR_PIN17                          (0x1U<<17U)
#define GPIO_DIR_PIN16                          (0x1U<<16U)
#define GPIO_DIR_PIN15                          (0x1U<<15U)
#define GPIO_DIR_PIN14                          (0x1U<<14U)
#define GPIO_DIR_PIN13                          (0x1U<<13U)
#define GPIO_DIR_PIN12                          (0x1U<<12U)
#define GPIO_DIR_PIN11                          (0x1U<<11U)
#define GPIO_DIR_PIN10                          (0x1U<<10U)
#define GPIO_DIR_PIN9                           (0x1U<<9U)
#define GPIO_DIR_PIN8                           (0x1U<<8U)
#define GPIO_DIR_PIN7                           (0x1U<<7U)
#define GPIO_DIR_PIN6                           (0x1U<<6U)
#define GPIO_DIR_PIN5                           (0x1U<<5U)
#define GPIO_DIR_PIN4                           (0x1U<<4U)
#define GPIO_DIR_PIN3                           (0x1U<<3U)
#define GPIO_DIR_PIN2                           (0x1U<<2U)
#define GPIO_DIR_PIN1                           (0x1U<<1U)
#define GPIO_DIR_PIN0                           (0x1U<<0U)
#define GPIO_DIR_PIN31_INPUT                    (0x0U<<31U)
#define GPIO_DIR_PIN31_OUTPUT                   (0x1U<<31U)
#define GPIO_DIR_PIN30_INPUT                    (0x0U<<30U)
#define GPIO_DIR_PIN30_OUTPUT                   (0x1U<<30U)
#define GPIO_DIR_PIN29_INPUT                    (0x0U<<29U)
#define GPIO_DIR_PIN29_OUTPUT                   (0x1U<<29U)
#define GPIO_DIR_PIN28_INPUT                    (0x0U<<28U)
#define GPIO_DIR_PIN28_OUTPUT                   (0x1U<<28U)
#define GPIO_DIR_PIN27_INPUT                    (0x0U<<27U)
#define GPIO_DIR_PIN27_OUTPUT                   (0x1U<<27U)
#define GPIO_DIR_PIN26_INPUT                    (0x0U<<26U)
#define GPIO_DIR_PIN26_OUTPUT                   (0x1U<<26U)
#define GPIO_DIR_PIN25_INPUT                    (0x0U<<25U)
#define GPIO_DIR_PIN25_OUTPUT                   (0x1U<<25U)
#define GPIO_DIR_PIN24_INPUT                    (0x0U<<24U)
#define GPIO_DIR_PIN24_OUTPUT                   (0x1U<<24U)
#define GPIO_DIR_PIN23_INPUT                    (0x0U<<23U)
#define GPIO_DIR_PIN23_OUTPUT                   (0x1U<<23U)
#define GPIO_DIR_PIN22_INPUT                    (0x0U<<22U)
#define GPIO_DIR_PIN22_OUTPUT                   (0x1U<<22U)
#define GPIO_DIR_PIN21_INPUT                    (0x0U<<21U)
#define GPIO_DIR_PIN21_OUTPUT                   (0x1U<<21U)
#define GPIO_DIR_PIN20_INPUT                    (0x0U<<20U)
#define GPIO_DIR_PIN20_OUTPUT                   (0x1U<<20U)
#define GPIO_DIR_PIN19_INPUT                    (0x0U<<19U)
#define GPIO_DIR_PIN19_OUTPUT                   (0x1U<<19U)
#define GPIO_DIR_PIN18_INPUT                    (0x0U<<18U)
#define GPIO_DIR_PIN18_OUTPUT                   (0x1U<<18U)
#define GPIO_DIR_PIN17_INPUT                    (0x0U<<17U)
#define GPIO_DIR_PIN17_OUTPUT                   (0x1U<<17U)
#define GPIO_DIR_PIN16_INPUT                    (0x0U<<16U)
#define GPIO_DIR_PIN16_OUTPUT                   (0x1U<<16U)
#define GPIO_DIR_PIN15_INPUT                    (0x0U<<15U)
#define GPIO_DIR_PIN15_OUTPUT                   (0x1U<<15U)
#define GPIO_DIR_PIN14_INPUT                    (0x0U<<14U)
#define GPIO_DIR_PIN14_OUTPUT                   (0x1U<<14U)
#define GPIO_DIR_PIN13_INPUT                    (0x0U<<13U)
#define GPIO_DIR_PIN13_OUTPUT                   (0x1U<<13U)
#define GPIO_DIR_PIN12_INPUT                    (0x0U<<12U)
#define GPIO_DIR_PIN12_OUTPUT                   (0x1U<<12U)
#define GPIO_DIR_PIN11_INPUT                    (0x0U<<11U)
#define GPIO_DIR_PIN11_OUTPUT                   (0x1U<<11U)
#define GPIO_DIR_PIN10_INPUT                    (0x0U<<10U)
#define GPIO_DIR_PIN10_OUTPUT                   (0x1U<<10U)
#define GPIO_DIR_PIN9_INPUT                     (0x0U<<9U)
#define GPIO_DIR_PIN9_OUTPUT                    (0x1U<<9U)
#define GPIO_DIR_PIN8_INPUT                     (0x0U<<8U)
#define GPIO_DIR_PIN8_OUTPUT                    (0x1U<<8U)
#define GPIO_DIR_PIN7_INPUT                     (0x0U<<7U)
#define GPIO_DIR_PIN7_OUTPUT                    (0x1U<<7U)
#define GPIO_DIR_PIN6_INPUT                     (0x0U<<6U)
#define GPIO_DIR_PIN6_OUTPUT                    (0x1U<<6U)
#define GPIO_DIR_PIN5_INPUT                     (0x0U<<5U)
#define GPIO_DIR_PIN5_OUTPUT                    (0x1U<<5U)
#define GPIO_DIR_PIN4_INPUT                     (0x0U<<4U)
#define GPIO_DIR_PIN4_OUTPUT                    (0x1U<<4U)
#define GPIO_DIR_PIN3_INPUT                     (0x0U<<3U)
#define GPIO_DIR_PIN3_OUTPUT                    (0x1U<<3U)
#define GPIO_DIR_PIN2_INPUT                     (0x0U<<2U)
#define GPIO_DIR_PIN2_OUTPUT                    (0x1U<<2U)
#define GPIO_DIR_PIN1_INPUT                     (0x0U<<1U)
#define GPIO_DIR_PIN1_OUTPUT                    (0x1U<<1U)
#define GPIO_DIR_PIN0_INPUT                     (0x0U<<0U)
#define GPIO_DIR_PIN0_OUTPUT                    (0x1U<<0U)

// DIRSET Configuration

