Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_gpio.h
#define GPIO_DIRSET_PIN31                       (0x1U<<31U)
#define GPIO_DIRSET_PIN30                       (0x1U<<30U)
#define GPIO_DIRSET_PIN29                       (0x1U<<29U)
#define GPIO_DIRSET_PIN28                       (0x1U<<28U)
#define GPIO_DIRSET_PIN27                       (0x1U<<27U)
#define GPIO_DIRSET_PIN26                       (0x1U<<26U)
#define GPIO_DIRSET_PIN25                       (0x1U<<25U)
#define GPIO_DIRSET_PIN24                       (0x1U<<24U)
#define GPIO_DIRSET_PIN23                       (0x1U<<23U)
#define GPIO_DIRSET_PIN22                       (0x1U<<22U)
#define GPIO_DIRSET_PIN21                       (0x1U<<21U)
#define GPIO_DIRSET_PIN20                       (0x1U<<20U)
#define GPIO_DIRSET_PIN19                       (0x1U<<19U)
#define GPIO_DIRSET_PIN18                       (0x1U<<18U)
#define GPIO_DIRSET_PIN17                       (0x1U<<17U)
#define GPIO_DIRSET_PIN16                       (0x1U<<16U)
#define GPIO_DIRSET_PIN15                       (0x1U<<15U)
#define GPIO_DIRSET_PIN14                       (0x1U<<14U)
#define GPIO_DIRSET_PIN13                       (0x1U<<13U)
#define GPIO_DIRSET_PIN12                       (0x1U<<12U)
#define GPIO_DIRSET_PIN11                       (0x1U<<11U)
#define GPIO_DIRSET_PIN10                       (0x1U<<10U)
#define GPIO_DIRSET_PIN9                        (0x1U<<9U)
#define GPIO_DIRSET_PIN8                        (0x1U<<8U)
#define GPIO_DIRSET_PIN7                        (0x1U<<7U)
#define GPIO_DIRSET_PIN6                        (0x1U<<6U)
#define GPIO_DIRSET_PIN5                        (0x1U<<5U)
#define GPIO_DIRSET_PIN4                        (0x1U<<4U)
#define GPIO_DIRSET_PIN3                        (0x1U<<3U)
#define GPIO_DIRSET_PIN2                        (0x1U<<2U)
#define GPIO_DIRSET_PIN1                        (0x1U<<1U)
#define GPIO_DIRSET_PIN0                        (0x1U<<0U)
#define GPIO_DIRSET_PIN31_INPUT                 (0x0U<<31U)
#define GPIO_DIRSET_PIN31_OUTPUT                (0x1U<<31U)
#define GPIO_DIRSET_PIN31_SET                   (0x1U<<31U)
#define GPIO_DIRSET_PIN30_INPUT                 (0x0U<<30U)
#define GPIO_DIRSET_PIN30_OUTPUT                (0x1U<<30U)
#define GPIO_DIRSET_PIN30_SET                   (0x1U<<30U)
#define GPIO_DIRSET_PIN29_INPUT                 (0x0U<<29U)
#define GPIO_DIRSET_PIN29_OUTPUT                (0x1U<<29U)
#define GPIO_DIRSET_PIN29_SET                   (0x1U<<29U)
#define GPIO_DIRSET_PIN28_INPUT                 (0x0U<<28U)
#define GPIO_DIRSET_PIN28_OUTPUT                (0x1U<<28U)
#define GPIO_DIRSET_PIN28_SET                   (0x1U<<28U)
#define GPIO_DIRSET_PIN27_INPUT                 (0x0U<<27U)
#define GPIO_DIRSET_PIN27_OUTPUT                (0x1U<<27U)
#define GPIO_DIRSET_PIN27_SET                   (0x1U<<27U)
#define GPIO_DIRSET_PIN26_INPUT                 (0x0U<<26U)
#define GPIO_DIRSET_PIN26_OUTPUT                (0x1U<<26U)
#define GPIO_DIRSET_PIN26_SET                   (0x1U<<26U)
#define GPIO_DIRSET_PIN25_INPUT                 (0x0U<<25U)
#define GPIO_DIRSET_PIN25_OUTPUT                (0x1U<<25U)
#define GPIO_DIRSET_PIN25_SET                   (0x1U<<25U)
#define GPIO_DIRSET_PIN24_INPUT                 (0x0U<<24U)
#define GPIO_DIRSET_PIN24_OUTPUT                (0x1U<<24U)
#define GPIO_DIRSET_PIN24_SET                   (0x1U<<24U)
#define GPIO_DIRSET_PIN23_INPUT                 (0x0U<<23U)
#define GPIO_DIRSET_PIN23_OUTPUT                (0x1U<<23U)
#define GPIO_DIRSET_PIN23_SET                   (0x1U<<23U)
#define GPIO_DIRSET_PIN22_INPUT                 (0x0U<<22U)
#define GPIO_DIRSET_PIN22_OUTPUT                (0x1U<<22U)
#define GPIO_DIRSET_PIN22_SET                   (0x1U<<22U)
#define GPIO_DIRSET_PIN21_INPUT                 (0x0U<<21U)
#define GPIO_DIRSET_PIN21_OUTPUT                (0x1U<<21U)
#define GPIO_DIRSET_PIN21_SET                   (0x1U<<21U)
#define GPIO_DIRSET_PIN20_INPUT                 (0x0U<<20U)
#define GPIO_DIRSET_PIN20_OUTPUT                (0x1U<<20U)
#define GPIO_DIRSET_PIN20_SET                   (0x1U<<20U)
#define GPIO_DIRSET_PIN19_INPUT                 (0x0U<<19U)
#define GPIO_DIRSET_PIN19_OUTPUT                (0x1U<<19U)
#define GPIO_DIRSET_PIN19_SET                   (0x1U<<19U)
#define GPIO_DIRSET_PIN18_INPUT                 (0x0U<<18U)
#define GPIO_DIRSET_PIN18_OUTPUT                (0x1U<<18U)
#define GPIO_DIRSET_PIN18_SET                   (0x1U<<18U)
#define GPIO_DIRSET_PIN17_INPUT                 (0x0U<<17U)
#define GPIO_DIRSET_PIN17_OUTPUT                (0x1U<<17U)
#define GPIO_DIRSET_PIN17_SET                   (0x1U<<17U)
#define GPIO_DIRSET_PIN16_INPUT                 (0x0U<<16U)
#define GPIO_DIRSET_PIN16_OUTPUT                (0x1U<<16U)
#define GPIO_DIRSET_PIN16_SET                   (0x1U<<16U)
#define GPIO_DIRSET_PIN15_INPUT                 (0x0U<<15U)
#define GPIO_DIRSET_PIN15_OUTPUT                (0x1U<<15U)
#define GPIO_DIRSET_PIN15_SET                   (0x1U<<15U)
#define GPIO_DIRSET_PIN14_INPUT                 (0x0U<<14U)
#define GPIO_DIRSET_PIN14_OUTPUT                (0x1U<<14U)
#define GPIO_DIRSET_PIN14_SET                   (0x1U<<14U)
#define GPIO_DIRSET_PIN13_INPUT                 (0x0U<<13U)
#define GPIO_DIRSET_PIN13_OUTPUT                (0x1U<<13U)
#define GPIO_DIRSET_PIN13_SET                   (0x1U<<13U)
#define GPIO_DIRSET_PIN12_INPUT                 (0x0U<<12U)
#define GPIO_DIRSET_PIN12_OUTPUT                (0x1U<<12U)
#define GPIO_DIRSET_PIN12_SET                   (0x1U<<12U)
#define GPIO_DIRSET_PIN11_INPUT                 (0x0U<<11U)
#define GPIO_DIRSET_PIN11_OUTPUT                (0x1U<<11U)
#define GPIO_DIRSET_PIN11_SET                   (0x1U<<11U)
#define GPIO_DIRSET_PIN10_INPUT                 (0x0U<<10U)
#define GPIO_DIRSET_PIN10_OUTPUT                (0x1U<<10U)
#define GPIO_DIRSET_PIN10_SET                   (0x1U<<10U)
#define GPIO_DIRSET_PIN9_INPUT                  (0x0U<<9U)
#define GPIO_DIRSET_PIN9_OUTPUT                 (0x1U<<9U)
#define GPIO_DIRSET_PIN9_SET                    (0x1U<<9U)
#define GPIO_DIRSET_PIN8_INPUT                  (0x0U<<8U)
#define GPIO_DIRSET_PIN8_OUTPUT                 (0x1U<<8U)
#define GPIO_DIRSET_PIN8_SET                    (0x1U<<8U)
#define GPIO_DIRSET_PIN7_INPUT                  (0x0U<<7U)
#define GPIO_DIRSET_PIN7_OUTPUT                 (0x1U<<7U)
#define GPIO_DIRSET_PIN7_SET                    (0x1U<<7U)
#define GPIO_DIRSET_PIN6_INPUT                  (0x0U<<6U)
#define GPIO_DIRSET_PIN6_OUTPUT                 (0x1U<<6U)
#define GPIO_DIRSET_PIN6_SET                    (0x1U<<6U)
#define GPIO_DIRSET_PIN5_INPUT                  (0x0U<<5U)
#define GPIO_DIRSET_PIN5_OUTPUT                 (0x1U<<5U)
#define GPIO_DIRSET_PIN5_SET                    (0x1U<<5U)
#define GPIO_DIRSET_PIN4_INPUT                  (0x0U<<4U)
#define GPIO_DIRSET_PIN4_OUTPUT                 (0x1U<<4U)
#define GPIO_DIRSET_PIN4_SET                    (0x1U<<4U)
#define GPIO_DIRSET_PIN3_INPUT                  (0x0U<<3U)
#define GPIO_DIRSET_PIN3_OUTPUT                 (0x1U<<3U)
#define GPIO_DIRSET_PIN3_SET                    (0x1U<<3U)
#define GPIO_DIRSET_PIN2_INPUT                  (0x0U<<2U)
#define GPIO_DIRSET_PIN2_OUTPUT                 (0x1U<<2U)
#define GPIO_DIRSET_PIN2_SET                    (0x1U<<2U)
#define GPIO_DIRSET_PIN1_INPUT                  (0x0U<<1U)
#define GPIO_DIRSET_PIN1_OUTPUT                 (0x1U<<1U)
#define GPIO_DIRSET_PIN1_SET                    (0x1U<<1U)
#define GPIO_DIRSET_PIN0_INPUT                  (0x0U<<0U)
#define GPIO_DIRSET_PIN0_OUTPUT                 (0x1U<<0U)
#define GPIO_DIRSET_PIN0_SET                    (0x1U<<0U)

// DIRCLR Configuration

#define GPIO_DIRCLR_PIN31                       (0x1U<<31U)
#define GPIO_DIRCLR_PIN30                       (0x1U<<30U)
#define GPIO_DIRCLR_PIN29                       (0x1U<<29U)
#define GPIO_DIRCLR_PIN28                       (0x1U<<28U)
#define GPIO_DIRCLR_PIN27                       (0x1U<<27U)
#define GPIO_DIRCLR_PIN26                       (0x1U<<26U)
#define GPIO_DIRCLR_PIN25                       (0x1U<<25U)
#define GPIO_DIRCLR_PIN24                       (0x1U<<24U)
#define GPIO_DIRCLR_PIN23                       (0x1U<<23U)
#define GPIO_DIRCLR_PIN22                       (0x1U<<22U)
#define GPIO_DIRCLR_PIN21                       (0x1U<<21U)
#define GPIO_DIRCLR_PIN20                       (0x1U<<20U)
#define GPIO_DIRCLR_PIN19                       (0x1U<<19U)
#define GPIO_DIRCLR_PIN18                       (0x1U<<18U)
#define GPIO_DIRCLR_PIN17                       (0x1U<<17U)
#define GPIO_DIRCLR_PIN16                       (0x1U<<16U)
#define GPIO_DIRCLR_PIN15                       (0x1U<<15U)
#define GPIO_DIRCLR_PIN14                       (0x1U<<14U)
#define GPIO_DIRCLR_PIN13                       (0x1U<<13U)
#define GPIO_DIRCLR_PIN12                       (0x1U<<12U)
#define GPIO_DIRCLR_PIN11                       (0x1U<<11U)
#define GPIO_DIRCLR_PIN10                       (0x1U<<10U)
#define GPIO_DIRCLR_PIN9                        (0x1U<<9U)
#define GPIO_DIRCLR_PIN8                        (0x1U<<8U)
#define GPIO_DIRCLR_PIN7                        (0x1U<<7U)
#define GPIO_DIRCLR_PIN6                        (0x1U<<6U)
#define GPIO_DIRCLR_PIN5                        (0x1U<<5U)
#define GPIO_DIRCLR_PIN4                        (0x1U<<4U)
#define GPIO_DIRCLR_PIN3                        (0x1U<<3U)
#define GPIO_DIRCLR_PIN2                        (0x1U<<2U)
#define GPIO_DIRCLR_PIN1                        (0x1U<<1U)
#define GPIO_DIRCLR_PIN0                        (0x1U<<0U)
#define GPIO_DIRCLR_PIN31_INPUT                 (0x0U<<31U)
#define GPIO_DIRCLR_PIN31_OUTPUT                (0x1U<<31U)
#define GPIO_DIRCLR_PIN31_CLEAR                 (0x1U<<31U)
#define GPIO_DIRCLR_PIN30_INPUT                 (0x0U<<30U)
#define GPIO_DIRCLR_PIN30_OUTPUT                (0x1U<<30U)
#define GPIO_DIRCLR_PIN30_CLEAR                 (0x1U<<30U)
#define GPIO_DIRCLR_PIN29_INPUT                 (0x0U<<29U)
#define GPIO_DIRCLR_PIN29_OUTPUT                (0x1U<<29U)
#define GPIO_DIRCLR_PIN29_CLEAR                 (0x1U<<29U)
#define GPIO_DIRCLR_PIN28_INPUT                 (0x0U<<28U)
#define GPIO_DIRCLR_PIN28_OUTPUT                (0x1U<<28U)
#define GPIO_DIRCLR_PIN28_CLEAR                 (0x1U<<28U)
#define GPIO_DIRCLR_PIN27_INPUT                 (0x0U<<27U)
#define GPIO_DIRCLR_PIN27_OUTPUT                (0x1U<<27U)
#define GPIO_DIRCLR_PIN27_CLEAR                 (0x1U<<27U)
#define GPIO_DIRCLR_PIN26_INPUT                 (0x0U<<26U)
#define GPIO_DIRCLR_PIN26_OUTPUT                (0x1U<<26U)
#define GPIO_DIRCLR_PIN26_CLEAR                 (0x1U<<26U)
#define GPIO_DIRCLR_PIN25_INPUT                 (0x0U<<25U)
#define GPIO_DIRCLR_PIN25_OUTPUT                (0x1U<<25U)
#define GPIO_DIRCLR_PIN25_CLEAR                 (0x1U<<25U)
#define GPIO_DIRCLR_PIN24_INPUT                 (0x0U<<24U)
#define GPIO_DIRCLR_PIN24_OUTPUT                (0x1U<<24U)
#define GPIO_DIRCLR_PIN24_CLEAR                 (0x1U<<24U)
#define GPIO_DIRCLR_PIN23_INPUT                 (0x0U<<23U)
#define GPIO_DIRCLR_PIN23_OUTPUT                (0x1U<<23U)
#define GPIO_DIRCLR_PIN23_CLEAR                 (0x1U<<23U)
#define GPIO_DIRCLR_PIN22_INPUT                 (0x0U<<22U)
#define GPIO_DIRCLR_PIN22_OUTPUT                (0x1U<<22U)
#define GPIO_DIRCLR_PIN22_CLEAR                 (0x1U<<22U)
#define GPIO_DIRCLR_PIN21_INPUT                 (0x0U<<21U)
#define GPIO_DIRCLR_PIN21_OUTPUT                (0x1U<<21U)
#define GPIO_DIRCLR_PIN21_CLEAR                 (0x1U<<21U)
#define GPIO_DIRCLR_PIN20_INPUT                 (0x0U<<20U)
#define GPIO_DIRCLR_PIN20_OUTPUT                (0x1U<<20U)
#define GPIO_DIRCLR_PIN20_CLEAR                 (0x1U<<20U)
#define GPIO_DIRCLR_PIN19_INPUT                 (0x0U<<19U)
#define GPIO_DIRCLR_PIN19_OUTPUT                (0x1U<<19U)
#define GPIO_DIRCLR_PIN19_CLEAR                 (0x1U<<19U)
#define GPIO_DIRCLR_PIN18_INPUT                 (0x0U<<18U)
#define GPIO_DIRCLR_PIN18_OUTPUT                (0x1U<<18U)
#define GPIO_DIRCLR_PIN18_CLEAR                 (0x1U<<18U)
#define GPIO_DIRCLR_PIN17_INPUT                 (0x0U<<17U)
#define GPIO_DIRCLR_PIN17_OUTPUT                (0x1U<<17U)
#define GPIO_DIRCLR_PIN17_CLEAR                 (0x1U<<17U)
#define GPIO_DIRCLR_PIN16_INPUT                 (0x0U<<16U)
#define GPIO_DIRCLR_PIN16_OUTPUT                (0x1U<<16U)
#define GPIO_DIRCLR_PIN16_CLEAR                 (0x1U<<16U)
#define GPIO_DIRCLR_PIN15_INPUT                 (0x0U<<15U)
#define GPIO_DIRCLR_PIN15_OUTPUT                (0x1U<<15U)
#define GPIO_DIRCLR_PIN15_CLEAR                 (0x1U<<15U)
#define GPIO_DIRCLR_PIN14_INPUT                 (0x0U<<14U)
#define GPIO_DIRCLR_PIN14_OUTPUT                (0x1U<<14U)
#define GPIO_DIRCLR_PIN14_CLEAR                 (0x1U<<14U)
#define GPIO_DIRCLR_PIN13_INPUT                 (0x0U<<13U)
#define GPIO_DIRCLR_PIN13_OUTPUT                (0x1U<<13U)
#define GPIO_DIRCLR_PIN13_CLEAR                 (0x1U<<13U)
#define GPIO_DIRCLR_PIN12_INPUT                 (0x0U<<12U)
#define GPIO_DIRCLR_PIN12_OUTPUT                (0x1U<<12U)
#define GPIO_DIRCLR_PIN12_CLEAR                 (0x1U<<12U)
#define GPIO_DIRCLR_PIN11_INPUT                 (0x0U<<11U)
#define GPIO_DIRCLR_PIN11_OUTPUT                (0x1U<<11U)
#define GPIO_DIRCLR_PIN11_CLEAR                 (0x1U<<11U)
#define GPIO_DIRCLR_PIN10_INPUT                 (0x0U<<10U)
#define GPIO_DIRCLR_PIN10_OUTPUT                (0x1U<<10U)
#define GPIO_DIRCLR_PIN10_CLEAR                 (0x1U<<10U)
#define GPIO_DIRCLR_PIN9_INPUT                  (0x0U<<9U)
#define GPIO_DIRCLR_PIN9_OUTPUT                 (0x1U<<9U)
#define GPIO_DIRCLR_PIN9_CLEAR                  (0x1U<<9U)
#define GPIO_DIRCLR_PIN8_INPUT                  (0x0U<<8U)
#define GPIO_DIRCLR_PIN8_OUTPUT                 (0x1U<<8U)
#define GPIO_DIRCLR_PIN8_CLEAR                  (0x1U<<8U)
#define GPIO_DIRCLR_PIN7_INPUT                  (0x0U<<7U)
#define GPIO_DIRCLR_PIN7_OUTPUT                 (0x1U<<7U)
#define GPIO_DIRCLR_PIN7_CLEAR                  (0x1U<<7U)
#define GPIO_DIRCLR_PIN6_INPUT                  (0x0U<<6U)
#define GPIO_DIRCLR_PIN6_OUTPUT                 (0x1U<<6U)
#define GPIO_DIRCLR_PIN6_CLEAR                  (0x1U<<6U)
#define GPIO_DIRCLR_PIN5_INPUT                  (0x0U<<5U)
#define GPIO_DIRCLR_PIN5_OUTPUT                 (0x1U<<5U)
#define GPIO_DIRCLR_PIN5_CLEAR                  (0x1U<<5U)
#define GPIO_DIRCLR_PIN4_INPUT                  (0x0U<<4U)
#define GPIO_DIRCLR_PIN4_OUTPUT                 (0x1U<<4U)
#define GPIO_DIRCLR_PIN4_CLEAR                  (0x1U<<4U)
#define GPIO_DIRCLR_PIN3_INPUT                  (0x0U<<3U)
#define GPIO_DIRCLR_PIN3_OUTPUT                 (0x1U<<3U)
#define GPIO_DIRCLR_PIN3_CLEAR                  (0x1U<<3U)
#define GPIO_DIRCLR_PIN2_INPUT                  (0x0U<<2U)
#define GPIO_DIRCLR_PIN2_OUTPUT                 (0x1U<<2U)
#define GPIO_DIRCLR_PIN2_CLEAR                  (0x1U<<2U)
#define GPIO_DIRCLR_PIN1_INPUT                  (0x0U<<1U)
#define GPIO_DIRCLR_PIN1_OUTPUT                 (0x1U<<1U)
#define GPIO_DIRCLR_PIN1_CLEAR                  (0x1U<<1U)
#define GPIO_DIRCLR_PIN0_INPUT                  (0x0U<<0U)
#define GPIO_DIRCLR_PIN0_OUTPUT                 (0x1U<<0U)
#define GPIO_DIRCLR_PIN0_CLEAR                  (0x1U<<0U)

