Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_gpio.h
// LATCH Configuration

#define GPIO_LATCH_PIN31                        (0x1U<<31U)
#define GPIO_LATCH_PIN30                        (0x1U<<30U)
#define GPIO_LATCH_PIN29                        (0x1U<<29U)
#define GPIO_LATCH_PIN28                        (0x1U<<28U)
#define GPIO_LATCH_PIN27                        (0x1U<<27U)
#define GPIO_LATCH_PIN26                        (0x1U<<26U)
#define GPIO_LATCH_PIN25                        (0x1U<<25U)
#define GPIO_LATCH_PIN24                        (0x1U<<24U)
#define GPIO_LATCH_PIN23                        (0x1U<<23U)
#define GPIO_LATCH_PIN22                        (0x1U<<22U)
#define GPIO_LATCH_PIN21                        (0x1U<<21U)
#define GPIO_LATCH_PIN20                        (0x1U<<20U)
#define GPIO_LATCH_PIN19                        (0x1U<<19U)
#define GPIO_LATCH_PIN18                        (0x1U<<18U)
#define GPIO_LATCH_PIN17                        (0x1U<<17U)
#define GPIO_LATCH_PIN16                        (0x1U<<16U)
#define GPIO_LATCH_PIN15                        (0x1U<<15U)
#define GPIO_LATCH_PIN14                        (0x1U<<14U)
#define GPIO_LATCH_PIN13                        (0x1U<<13U)
#define GPIO_LATCH_PIN12                        (0x1U<<12U)
#define GPIO_LATCH_PIN11                        (0x1U<<11U)
#define GPIO_LATCH_PIN10                        (0x1U<<10U)
#define GPIO_LATCH_PIN9                         (0x1U<<9U)
#define GPIO_LATCH_PIN8                         (0x1U<<8U)
#define GPIO_LATCH_PIN7                         (0x1U<<7U)
#define GPIO_LATCH_PIN6                         (0x1U<<6U)
#define GPIO_LATCH_PIN5                         (0x1U<<5U)
#define GPIO_LATCH_PIN4                         (0x1U<<4U)
#define GPIO_LATCH_PIN3                         (0x1U<<3U)
#define GPIO_LATCH_PIN2                         (0x1U<<2U)
#define GPIO_LATCH_PIN1                         (0x1U<<1U)
#define GPIO_LATCH_PIN0                         (0x1U<<0U)
#define GPIO_LATCH_PIN31_NOTLATCHED             (0x0U<<31U)
#define GPIO_LATCH_PIN31_LATCHED                (0x1U<<31U)
#define GPIO_LATCH_PIN30_NOTLATCHED             (0x0U<<30U)
#define GPIO_LATCH_PIN30_LATCHED                (0x1U<<30U)
#define GPIO_LATCH_PIN29_NOTLATCHED             (0x0U<<29U)
#define GPIO_LATCH_PIN29_LATCHED                (0x1U<<29U)
#define GPIO_LATCH_PIN28_NOTLATCHED             (0x0U<<28U)
#define GPIO_LATCH_PIN28_LATCHED                (0x1U<<28U)
#define GPIO_LATCH_PIN27_NOTLATCHED             (0x0U<<27U)
#define GPIO_LATCH_PIN27_LATCHED                (0x1U<<27U)
#define GPIO_LATCH_PIN26_NOTLATCHED             (0x0U<<26U)
#define GPIO_LATCH_PIN26_LATCHED                (0x1U<<26U)
#define GPIO_LATCH_PIN25_NOTLATCHED             (0x0U<<25U)
#define GPIO_LATCH_PIN25_LATCHED                (0x1U<<25U)
#define GPIO_LATCH_PIN24_NOTLATCHED             (0x0U<<24U)
#define GPIO_LATCH_PIN24_LATCHED                (0x1U<<24U)
#define GPIO_LATCH_PIN23_NOTLATCHED             (0x0U<<23U)
#define GPIO_LATCH_PIN23_LATCHED                (0x1U<<23U)
#define GPIO_LATCH_PIN22_NOTLATCHED             (0x0U<<22U)
#define GPIO_LATCH_PIN22_LATCHED                (0x1U<<22U)
#define GPIO_LATCH_PIN21_NOTLATCHED             (0x0U<<21U)
#define GPIO_LATCH_PIN21_LATCHED                (0x1U<<21U)
#define GPIO_LATCH_PIN20_NOTLATCHED             (0x0U<<20U)
#define GPIO_LATCH_PIN20_LATCHED                (0x1U<<20U)
#define GPIO_LATCH_PIN19_NOTLATCHED             (0x0U<<19U)
#define GPIO_LATCH_PIN19_LATCHED                (0x1U<<19U)
#define GPIO_LATCH_PIN18_NOTLATCHED             (0x0U<<18U)
#define GPIO_LATCH_PIN18_LATCHED                (0x1U<<18U)
#define GPIO_LATCH_PIN17_NOTLATCHED             (0x0U<<17U)
#define GPIO_LATCH_PIN17_LATCHED                (0x1U<<17U)
#define GPIO_LATCH_PIN16_NOTLATCHED             (0x0U<<16U)
#define GPIO_LATCH_PIN16_LATCHED                (0x1U<<16U)
#define GPIO_LATCH_PIN15_NOTLATCHED             (0x0U<<15U)
#define GPIO_LATCH_PIN15_LATCHED                (0x1U<<15U)
#define GPIO_LATCH_PIN14_NOTLATCHED             (0x0U<<14U)
#define GPIO_LATCH_PIN14_LATCHED                (0x1U<<14U)
#define GPIO_LATCH_PIN13_NOTLATCHED             (0x0U<<13U)
#define GPIO_LATCH_PIN13_LATCHED                (0x1U<<13U)
#define GPIO_LATCH_PIN12_NOTLATCHED             (0x0U<<12U)
#define GPIO_LATCH_PIN12_LATCHED                (0x1U<<12U)
#define GPIO_LATCH_PIN11_NOTLATCHED             (0x0U<<11U)
#define GPIO_LATCH_PIN11_LATCHED                (0x1U<<11U)
#define GPIO_LATCH_PIN10_NOTLATCHED             (0x0U<<10U)
#define GPIO_LATCH_PIN10_LATCHED                (0x1U<<10U)
#define GPIO_LATCH_PIN9_NOTLATCHED              (0x0U<<9U)
#define GPIO_LATCH_PIN9_LATCHED                 (0x1U<<9U)
#define GPIO_LATCH_PIN8_NOTLATCHED              (0x0U<<8U)
#define GPIO_LATCH_PIN8_LATCHED                 (0x1U<<8U)
#define GPIO_LATCH_PIN7_NOTLATCHED              (0x0U<<7U)
#define GPIO_LATCH_PIN7_LATCHED                 (0x1U<<7U)
#define GPIO_LATCH_PIN6_NOTLATCHED              (0x0U<<6U)
#define GPIO_LATCH_PIN6_LATCHED                 (0x1U<<6U)
#define GPIO_LATCH_PIN5_NOTLATCHED              (0x0U<<5U)
#define GPIO_LATCH_PIN5_LATCHED                 (0x1U<<5U)
#define GPIO_LATCH_PIN4_NOTLATCHED              (0x0U<<4U)
#define GPIO_LATCH_PIN4_LATCHED                 (0x1U<<4U)
#define GPIO_LATCH_PIN3_NOTLATCHED              (0x0U<<3U)
#define GPIO_LATCH_PIN3_LATCHED                 (0x1U<<3U)
#define GPIO_LATCH_PIN2_NOTLATCHED              (0x0U<<2U)
#define GPIO_LATCH_PIN2_LATCHED                 (0x1U<<2U)
#define GPIO_LATCH_PIN1_NOTLATCHED              (0x0U<<1U)
#define GPIO_LATCH_PIN1_LATCHED                 (0x1U<<1U)
#define GPIO_LATCH_PIN0_NOTLATCHED              (0x0U<<0U)
#define GPIO_LATCH_PIN0_LATCHED                 (0x1U<<0U)

// DETECTMODE Configuration

#define GPIO_DETECTMODE_DETECTMODE              (0x1U<<0U)
#define GPIO_DETECTMODE_DETECTMODE_DEFAULT      (0x0U<<0U)
#define GPIO_DETECTMODE_DETECTMODE_LDETECT      (0x1U<<0U)

// DETECTMODE_SEC Configuration

#define GPIO_DETECTMODE_SEC_DETECTMODE          (0x1U<<0U)
#define GPIO_DETECTMODE_SEC_DETECTMODE_DEFAULT  (0x0U<<0U)
#define GPIO_DETECTMODE_SEC_DETECTMODE_LDETECT  (0x1U<<0U)

// PIN_CNF Configuration

