Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_gpio.h
#define GPIO_PIN_CNF_MCUSEL                     (0x7U<<28U)
#define GPIO_PIN_CNF_MCUSEL_0                   (0x1U<<28U)
#define GPIO_PIN_CNF_SENSE                      (0x3U<<16U)
#define GPIO_PIN_CNF_SENSE_0                    (0x1U<<16U)
#define GPIO_PIN_CNF_DRIVE                      (0xFU<<8U)
#define GPIO_PIN_CNF_DRIVE_0                    (0x1U<<8U)
#define GPIO_PIN_CNF_PULL                       (0x3U<<2U)
#define GPIO_PIN_CNF_PULL_0                     (0x1U<<2U)
#define GPIO_PIN_CNF_INPUT                      (0x1U<<1U)
#define GPIO_PIN_CNF_DIR                        (0x1U<<0U)
#define GPIO_PIN_CNF_MCUSEL_APPMCU              (0x0U<<28U)
#define GPIO_PIN_CNF_MCUSEL_NETWORKMCU          (0x1U<<28U)
#define GPIO_PIN_CNF_MCUSEL_PERIPHERAL          (0x3U<<28U)
#define GPIO_PIN_CNF_MCUSEL_TND                 (0x7U<<28U)
#define GPIO_PIN_CNF_SENSE_DISABLED             (0x0U<<16U)
#define GPIO_PIN_CNF_SENSE_HIGH                 (0x2U<<16U)
#define GPIO_PIN_CNF_SENSE_LOW                  (0x3U<<16U)
#define GPIO_PIN_CNF_DRIVE_S0S1                 (0x0U<<8U)
#define GPIO_PIN_CNF_DRIVE_H0S1                 (0x1U<<8U)
#define GPIO_PIN_CNF_DRIVE_S0H1                 (0x2U<<8U)
#define GPIO_PIN_CNF_DRIVE_H0H1                 (0x3U<<8U)
#define GPIO_PIN_CNF_DRIVE_D0S1                 (0x4U<<8U)
#define GPIO_PIN_CNF_DRIVE_D0H1                 (0x5U<<8U)
#define GPIO_PIN_CNF_DRIVE_S0D1                 (0x6U<<8U)
#define GPIO_PIN_CNF_DRIVE_H0D1                 (0x7U<<8U)
#define GPIO_PIN_CNF_DRIVE_E0E1                 (0xBU<<8U)
#define GPIO_PIN_CNF_PULL_DISABLED              (0x0U<<2U)
#define GPIO_PIN_CNF_PULL_PULLDOWN              (0x1U<<2U)
#define GPIO_PIN_CNF_PULL_PULLUP                (0x3U<<2U)
#define GPIO_PIN_CNF_INPUT_CONNECT              (0x0U<<1U)
#define GPIO_PIN_CNF_INPUT_DISCONNECT           (0x1U<<1U)
#define GPIO_PIN_CNF_DIR_INPUT                  (0x0U<<0U)
#define GPIO_PIN_CNF_DIR_OUTPUT                 (0x1U<<0U)
